app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 1]]
---
<h2>Critic Reviews<%=link_to " (+)", new_movie_review_path(@movie)%>:</h2>
<% @movie.reviews.each do |review| %></p>