app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%Casino%') ORDER BY created_at DESC
---
  def index
    # Good job using one view with added search functionality
  @movies = Movie.all

INSERT INTO "movies" ("title", "director", "summary", "written_by", "poster_url", "release_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @movie = current_user.movies.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "summary" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["summary", "Batman kicks the Jokers ass, but joker is still the man."], ["updated_at", 2017-02-27 16:07:05 UTC], ["id", 3]]
---
  def update
    @movie = Movie.find(params[:id])
    @movie.update(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 4]]
---
  def destroy
    @movie = Movie.find(params[:id])
    if @movie.user == current_user
    @movie.destroy