app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "reviews" ("author", "content", "rating", "movie_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author", "Bedig"], ["content", "This movie is awesome"], ["rating", 5], ["movie_id", 2], ["created_at", 2017-02-28 16:39:00 UTC], ["updated_at", 2017-02-28 16:39:00 UTC], ["user_id", 1]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.create!(review_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "author" = $1, "content" = $2, "rating" = $3, "updated_at" = $4 WHERE "reviews"."id" = $5  [["author", "Roger Ebert"], ["content", "THis moie suuuuux"], ["rating", "Thank goodness I didn't pay for it"], ["updated_at", 2017-03-01 15:50:42 UTC], ["id", 3]]
---
  def update
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])
    @review.update(review_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 6]]
---
  def destroy
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])
    @review.destroy